; domain
(define (domain lego5b)
(:requirements :strips :typing :fluents)
(:types lego board)
(:predicates
    (onboard ?x - lego)
    (inbox ?x - lego)
    (attached ?x - lego)
    (inhand ?x - lego))

(:functions
    (total-board-space ?c - board)
    (total-area ?x - lego)
    (taken-space ?c - board)
    (exposed-space ?c - board))

(:action pickup
  :parameters (?ob - lego)
  :precondition (and (inbox ?ob))
  :effect (and (inhand ?ob) 
	  (not (inbox ?ob))))

(:action place
  :parameters (?ob - lego ?bd - board)
  :precondition (and (inhand ?ob))  
  :effect (and (onboard ?ob) 
	       (not (inhand ?ob))
	       (decrease (exposed-space ?bd) (total-area ?ob))
	       (increase (taken-space ?bd) (total-area ?ob))))

(:action press
  :parameters (?ob - lego)
  :precondition (and (onboard ?ob))
  :effect (and (onboard ?ob)
	  (attached ?ob)))

)

; problem
(define (problem lego5-prob2)
  (:domain lego5b)
  (:objects red2x4 black2x2 white2x2 - lego brd - board)
  (:init (= (total-board-space brd) 16)
	 (= (total-area red2x4) 8)
	 (= (total-area black2x2) 4)
         (= (total-area white2x2) 4)
	 (= (taken-space brd) 0)
	 (= (exposed-space brd) 16)
	 (inbox red2x4)
	 (inbox white2x2)
	 (inbox black2x2))
  (:goal (and
		(attached red2x4)
		(attached white2x2)
		(attached black2x2)
		(= (exposed-space brd) 0)
		(= (taken-space brd) 16)))
)

; plan
1. (pickup white2x2)
   deleted: (inbox white2x2)
   added: (inhand white2x2)
   goals met: 0 of 5
2. (pickup red2x4)
   deleted: (inbox red2x4)
   added: (inhand red2x4)
   goals met: 0 of 5
3. (pickup black2x2)
   deleted: (inbox black2x2)
   added: (inhand black2x2)
   goals met: 0 of 5
4. (place white2x2 brd)
   deleted: (inhand white2x2)
   added: (onboard white2x2)
   changed: (exposed-space brd) from 16 to 12, (taken-space brd) from 0 to 4
   goals met: 0 of 5
5. (place red2x4 brd)
   deleted: (inhand red2x4)
   added: (onboard red2x4)
   changed: (exposed-space brd) from 12 to 4, (taken-space brd) from 4 to 12
   goals met: 0 of 5
6. (press white2x2)
   added: (attached white2x2)
   goals met: 1 of 5
7. (place black2x2 brd)
   deleted: (inhand black2x2)
   added: (onboard black2x2)
   changed: (exposed-space brd) from 4 to 0, (taken-space brd) from 12 to 16
   goals met: 3 of 5
8. (press red2x4)
   added: (attached red2x4)
   goals met: 4 of 5
9. (press black2x2)
   added: (attached black2x2)
   goals met: 5 of 5
